{
    "conversationId": "b0143a7b-1b23-4903-8961-2a43475866ac",
    "source": [
        {
            "id": "1",
            "sources": [],
            "text": "Russian Offensive Campaign Assessment, June 29, 2024."
        },
        {
            "id": "2",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "3",
            "sources": [],
            "text": "Angelica Evans, Riley Bailey, Christina Harward, Nicole Wolkov, and Frederick W."
        },
        {
            "id": "4",
            "sources": [],
            "text": "Kagan."
        },
        {
            "id": "5",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "6",
            "sources": [],
            "text": "June 29, 2024, 6pm ET."
        },
        {
            "id": "7",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "8",
            "sources": [],
            "text": "Two prominent Russian officials appear to be spearheading divergent paths for addressing religious extremism in Russia as ethnic and religious tension in Russia continues to rise."
        },
        {
            "id": "9",
            "sources": [],
            "text": "Russian Investigative Committee Head Alexander Bastrykin commented on the June 23 terrorist attacks in the Republic of Dagestan and claimed on June 29 that Islamic terrorists were \"able to carry their banner of Islamic terror\" into Russia and that the State Duma must respond to the threat of Islamic terrorists in Russia."
        },
        {
            "id": "10",
            "sources": [],
            "text": "Bastrykin's indictment of Islamists prompted backlash from Chechen Republic Head Ramzan Kadyrov, who urged Bastrykin and other Russian officials to choose their words carefully and avoid characterizing all Muslims as terrorists."
        },
        {
            "id": "11",
            "sources": [],
            "text": "Kadyrov warned that such statements threaten the unity and stability of Russia's socio-political situation."
        },
        {
            "id": "12",
            "sources": [],
            "text": "Russian milbloggers and lower-level Russian officials have previously participated in similar debates, and it is significant that Kadyrov was willing to openly criticize another high-level Kremlin official on this issue."
        },
        {
            "id": "13",
            "sources": [],
            "text": "Bastrykin has previously positioned himself as a prominent figure in Russia's ultranationalist movement and is placing himself at odds with Kadyrov, who often presents himself as a representative of Russia's Muslim minority."
        },
        {
            "id": "14",
            "sources": [],
            "text": "Putin previously attempted to quell concerns within the Russian information space about the threat posed by migrant and Muslim communities following the Crocus City Hall attack on March 22 by simultaneously calling for unspecified changes to Russia's migration policy and denouncing Islamophobia and xenophobia."
        },
        {
            "id": "15",
            "sources": [],
            "text": "Putin may weigh in on Bastrykin's and Kadyrov's debate in the coming days in hopes of similarly quelling concern among Russians and a possible future conflict between Bastrykin and Kadyrov."
        },
        {
            "id": "16",
            "sources": [],
            "text": ""
        },
        {
            "id": "17",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "18",
            "sources": [],
            "text": "Russian ultranationalists continue to express growing doubt in Russian authorities' ability to prevent another terrorist attack and to address ethnic and religious tensions within Russia following the June 23 terrorist attacks in the Republic of Dagestan."
        },
        {
            "id": "19",
            "sources": [],
            "text": "Russian ultranationalists widely circulated a story alleging that extremists harassed a Russian doctor in Dagestan who refused to see a patient who would not remove her niqab (a long garment worn by some Muslim women to cover their entire body and face, excluding their eyes) and claimed that extremist actors orchestrated the event to incite further ethnic and religious tensions within Dagestan."
        },
        {
            "id": "20",
            "sources": [],
            "text": "Russian ultranationalists also claimed that Dagestani officials know the identities of extremist thought leaders but have allowed radical Salafi-Jihadists to control entire spheres of public life within the republic."
        },
        {
            "id": "21",
            "sources": [],
            "text": "These claims led to renewed discussions about banning niqab in Russia, which prompted Bastrykin to voice indirect support for banning the style of dress."
        },
        {
            "id": "22",
            "sources": [],
            "text": "Select Western and Muslim-majority countries have imposed various statutes banning religious dress and garments that cover one's face, although the Russian ultranationalist discussion focusing on niqab is strange given the scarcity of Muslims wearing niqab in Russia."
        },
        {
            "id": "23",
            "sources": [],
            "text": "The Russian ultranationalist preoccupation with the niqab appears to be a talking point for ultranationalists to express their perception of an extremist threat emanating from Russia's Muslim-minority communities and to criticize Russian authorities for not doing enough to prevent what ultranationalists consider to be inevitable future terrorist attacks."
        },
        {
            "id": "24",
            "sources": [],
            "text": "Russian ultranationalists will likely continue to express their fears about further terrorist attacks in ways that further inflame ethnic and religious tension, and ISW continues to assess that Russian ultranationalist rhetoric is partially alienating minority and Muslim-majority communities and generating animosities that Salafi-Jihadi groups can exploit in recruitment efforts."
        },
        {
            "id": "25",
            "sources": [],
            "text": ""
        },
        {
            "id": "26",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "27",
            "sources": [],
            "text": "Ten Ukrainian civilians whom Russian and Belarusian authorities arrested and held in captivity or prison, including individuals detained before Russia's full-scale invasion of Ukraine, returned to Ukraine."
        },
        {
            "id": "28",
            "sources": [],
            "text": "Ukrainian President Volodymyr Zelensky stated on June 29 that 10 Ukrainian civilians returned to Ukraine from Russian and Belarusian captivity as part of the 53rd prisoner-of-war (POW) exchange that Ukrainian officials initially announced on June 25."
        },
        {
            "id": "29",
            "sources": [],
            "text": "Ukrainian officials stated that among the returned civilians were First Deputy Head of the Crimean Tatar Majlis Nariman Dzhelyal, whom Russian authorities arrested in 2021; two Ukrainian Greek Catholic Church priests, whom Russian authorities arrested in occupied Berdyansk in 2022; five Ukrainian citizens, whom Belarusian authorities arrested in Belarus; and two Ukrainian civilians, whom Russian authorities detained in occupied Donetsk Oblast in 2017."
        },
        {
            "id": "30",
            "sources": [],
            "text": "Zelensky stated that the Vatican mediated the return of the 10 Ukrainian civilians."
        },
        {
            "id": "31",
            "sources": [],
            "text": "Ukrainian and Russian officials have not commented on whether Russia received civilians or POWs in exchange for these 10 Ukrainian civilians."
        },
        {
            "id": "32",
            "sources": [],
            "text": ""
        },
        {
            "id": "33",
            "sources": [],
            "text": "\n"
        }
    ],
    "summary": [
        {
            "id": "1",
            "sources": [
                "8",
                "9",
                "10",
                "13"
            ],
            "text": "Two high-ranking Russian officials, Alexander Bastrykin and Ramzan Kadyrov, are arguing about how to address religious extremism as Russia's religious tension continues to escalate."
        },
        {
            "id": "2",
            "sources": [
                "9",
                "10",
                "11"
            ],
            "text": "Bastrykin's anti-Islamic comments after a terror attack have prompted criticism from Kadyrov, who represents Russia’s Muslim minority and warns such statements could destabilize the country."
        },
        {
            "id": "3",
            "sources": [
                "18",
                "19",
                "20"
            ],
            "text": "Russian ultranationalists are doubting the government's ability to prevent further terrorist attacks following the attack in Dagestan, and are accusing authorities of failing to curb extremism."
        },
        {
            "id": "4",
            "sources": [
                "21",
                "22",
                "23"
            ],
            "text": "There is support from ultranationalists for banning the niqab, a piece of religious dress, amidst growing fears of terrorism, despite the limited number of Muslims wearing the niqab in Russia."
        },
        {
            "id": "5",
            "sources": [
                "27",
                "28",
                "29",
                "30"
            ],
            "text": "Ten Ukrainian civilians, held prisoner by Russian and Belarusian authorities, have been returned to Ukraine, with the Vatican mediating their return."
        }
    ]
}