{
    "conversationId": "b0477497-66fb-42fe-88d2-749d846a7b63",
    "source": [
        {
            "id": "1",
            "sources": [],
            "text": "Russian Offensive Campaign Assessment, June 28, 2024."
        },
        {
            "id": "2",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "3",
            "sources": [],
            "text": "Grace Mappes, Christina Harward, Riley Bailey, Nicole Wolkov, and Frederick W."
        },
        {
            "id": "4",
            "sources": [],
            "text": "Kagan."
        },
        {
            "id": "5",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "6",
            "sources": [],
            "text": "June 28, 2024, 8pm ET."
        },
        {
            "id": "7",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "8",
            "sources": [],
            "text": "Russian President Vladimir Putin directed on June 28 the production and deployment of nuclear-capable short- and intermediate-range missiles following the American withdrawal from the Intermediate-Range Nuclear Forces (INF) treaty in 2019, likely as part of the Kremlin's ongoing reflexive control campaign to influence Western decision-making in Russia's favor."
        },
        {
            "id": "9",
            "sources": [],
            "text": "Putin attended a Russian Security Council meeting in which he claimed that Russia had vowed to uphold the INF's provisions against producing or deploying intermediate-range ground-based missiles until the United States violated these provisions and that Russia must now also produce and deploy such systems."
        },
        {
            "id": "10",
            "sources": [],
            "text": "The United States suspended participation in the INF on February 1, 2019, and withdrew from the treaty on August 2, 2019, due to Russian violations of the treaty with its development, testing, and deployment of intermediate-range 9M729 (SSC-8) missiles, and Russia suspended its participation in the INF in response on February 2, 2019."
        },
        {
            "id": "11",
            "sources": [],
            "text": "Putin specifically cited two 2024 US bilateral military exercises; one with the Philippines in Northern Luzon, Philippines on April 11 and a second with Denmark near Bornholm Island, Denmark on May 3-5."
        },
        {
            "id": "12",
            "sources": [],
            "text": "Both of these bilateral US exercises involved a Typhon Medium Range Capability (MRC) launcher, which US readouts specified can launch SM-6 and Tomahawk missiles."
        },
        {
            "id": "13",
            "sources": [],
            "text": "The SM-6 missiles have a maximum range of 370 kilometers, while the Tomahawks have a maximum range of about 2,500 kilometers."
        },
        {
            "id": "14",
            "sources": [],
            "text": "US officials did not specify which missiles, if any, may have been involved in either exercise."
        },
        {
            "id": "15",
            "sources": [],
            "text": ""
        },
        {
            "id": "16",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "17",
            "sources": [],
            "text": "Putin is more likely using these exercises as a scapegoat for his broader reflexive control campaign aimed at discouraging Western military assistance to Ukraine."
        },
        {
            "id": "18",
            "sources": [],
            "text": "These US and partner exercises involved launchers capable of launching missiles that could pose variable threats to Russia from the exercise locations."
        },
        {
            "id": "19",
            "sources": [],
            "text": "Bornholm Island is roughly 300 kilometers from the westernmost shore of Kaliningrad Oblast and roughly 1,400 kilometers from Moscow."
        },
        {
            "id": "20",
            "sources": [],
            "text": "The US Sixth Fleet specified that the Bornholm Island exercise involved transporting the Typhon launcher from land to shore as part of convoy protection rehearsals, suggesting that these exercises likely involved shorter-range weapons."
        },
        {
            "id": "21",
            "sources": [],
            "text": "The Russian border area closest to the Philippines – the area southwest of Vladivostok – is roughly 2,800 kilometers from Northern Luzon, out of range of the Tomahawk missiles."
        },
        {
            "id": "22",
            "sources": [],
            "text": "Putin's June 27 condemnation follows the People's Republic of China (PRC) delayed condemnation of the US exercise in Northern Luzon on May 30."
        },
        {
            "id": "23",
            "sources": [],
            "text": "Putin likely invoked the Philippines exercise in part to posture favorably to the PRC, North Korea, and Vietnam as he attempts to create a coalition of states in support of a new \"Eurasian security architecture."
        },
        {
            "id": "24",
            "sources": [],
            "text": "\" The Kremlin has invoked the fear of a nuclear confrontation between Russia and the West throughout its full-scale invasion to push the West to self-deter from providing Ukraine the weapons it needs to sustain its defense against Russian forces, and the Kremlin notably employs this effort during key moments in Western political discussions about further military assistance to Ukraine."
        },
        {
            "id": "25",
            "sources": [],
            "text": ""
        },
        {
            "id": "26",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "27",
            "sources": [],
            "text": "Ukrainian forces reportedly struck an oil depot in Russia on June 28 and reportedly struck a microelectronics plant and a military unit on the night of June 27 to 28."
        },
        {
            "id": "28",
            "sources": [],
            "text": "Tambov Oblast Governor Maksim Yegorov claimed that a drone struck an oil depot in Michurinsky Raion and started a fire on the morning of June 28."
        },
        {
            "id": "29",
            "sources": [],
            "text": "Russian opposition outlet Astra stated that the drone hit the Transnefteprodukt \"Nikolskoe\" linear production and dispatch station in Novonikolskoe."
        },
        {
            "id": "30",
            "sources": [],
            "text": "Astra also reported that Ukrainian forces struck an unspecified military unit in Karachev, Bryansk Oblast and the \"Kremniy El\" microelectronics plant in Bryansk City - one of the largest microelectronics manufacturers in Russia that makes components for military equipment - on the night of June 27 to 28."
        },
        {
            "id": "31",
            "sources": [],
            "text": "Bryansk Oblast Governor Alexander Bogomaz claimed that Russian forces suppressed a Ukrainian drone with electronic warfare (EW) over Bryansk City and that drone debris damaged an administrative building."
        },
        {
            "id": "32",
            "sources": [],
            "text": "The Russian Ministry of Defense (MoD) claimed that Russian forces destroyed 12 drones over Bryansk Oblast but did not mention any drone strikes against Tambov Oblast."
        },
        {
            "id": "33",
            "sources": [],
            "text": ""
        },
        {
            "id": "34",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "35",
            "sources": [],
            "text": "The Ukrainian Armed Forces Center for Strategic Communications (StratCom) reported on June 28 that Ukrainian forces have damaged or destroyed more than 30 Russian military aircraft in the first six months of 2024, although ISW cannot confirm this report fully."
        },
        {
            "id": "36",
            "sources": [],
            "text": "Ukrainian StratCom stated that Ukrainian forces destroyed or damaged nine Su-25 aircraft, one Su-57 aircraft, two MiG-31 aircraft, roughly 13 Su-34 aircraft, two Su-35 aircraft, two A-50 long-range radar detection aircraft, one Il-22M11 airborne command post aircraft, and one Tu-22M3 strategic bomber in the first six months of 2024."
        },
        {
            "id": "37",
            "sources": [],
            "text": "Ukrainian StratCom stated that most of the strikes against the Russian aircraft occurred in occupied Ukraine except for a handful of strikes over the Sea of Azov and within Russia."
        },
        {
            "id": "38",
            "sources": [],
            "text": "Ukrainian StratCom did not specify what portion of these Ukrainian strikes were air defense interceptions of Russian aircraft in flight and what percentage were strikes against Russian aircraft at airfields."
        },
        {
            "id": "39",
            "sources": [],
            "text": "Russian officials acknowledged that Ukrainian forces downed an A-50 long-range radar detection aircraft in February 2024 after Ukrainian forces reportedly shot down another A-50 aircraft and Il-22M11 airborne command post aircraft in January 2024."
        },
        {
            "id": "40",
            "sources": [],
            "text": "Satellite imagery indicates that Ukrainian strikes damaged at least one Russian Su-57 in June 2024, and footage indicates that Ukrainian forces downed a Russian Tu-22M3 strategic bomber in mid-April."
        },
        {
            "id": "41",
            "sources": [],
            "text": "Satellite imagery indicates that Ukrainian forces destroyed two MiG-31 aircraft in occupied Crimea in an ATACMS strike in May 2024."
        },
        {
            "id": "42",
            "sources": [],
            "text": "Ukrainian officials reported the downing of numerous Su-34 aircraft in February and March 2024, although ISW cannot verify these reports or Ukrainian StratCom's figures concerning Su-34, Su-35, and Su-25 aircraft."
        },
        {
            "id": "43",
            "sources": [],
            "text": "The downing of Russian aircraft, especially critical aircraft like the A-50 and Il-22, has previously temporarily constrained Russian aviation activities over occupied Ukraine, but Ukrainian forces have yet to be able to significantly attempt to contest the air domain."
        },
        {
            "id": "44",
            "sources": [],
            "text": "Ukrainian officials have routinely highlighted a need for additional air defense assets and advanced fighter aircraft in order to significantly contest the air domain and pursue air parity with Russian forces."
        },
        {
            "id": "45",
            "sources": [],
            "text": "Russian forces have exploited continued constraints on Ukraine's air defense umbrella to field Russian tactical aircraft regularly along the frontline that conduct widespread glide bomb strikes against Ukrainian positions in support of ongoing Russian offensive operations."
        },
        {
            "id": "46",
            "sources": [],
            "text": ""
        },
        {
            "id": "47",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "48",
            "sources": [],
            "text": "Many Russian elites have reportedly shifted from criticizing Russia's war effort in Ukraine to supporting it because they assess that Russia is prevailing."
        },
        {
            "id": "49",
            "sources": [],
            "text": "Russian opposition journalist and founder of Russian opposition television channel TV Rain Mikhail Zygar reported in a June 28 Foreign Affairs article that many Russian elites who were opposed to the war in 2022 started to support the war in 2023 because they \"believe Russia is prevailing [in the war]\" given Russia's slow but steady battlefield gains, a persisting Ukrainian munitions disadvantage, and perceived \"waning\" Western security assistance to Ukraine."
        },
        {
            "id": "50",
            "sources": [],
            "text": "One unspecified Russian oligarch who previously criticized the war reportedly told Zygar that Russia must win the war otherwise \"they won't allow us to live."
        },
        {
            "id": "51",
            "sources": [],
            "text": ""
        },
        {
            "id": "52",
            "sources": [],
            "text": ""
        },
        {
            "id": "53",
            "sources": [],
            "text": "and Russia would collapse."
        },
        {
            "id": "54",
            "sources": [],
            "text": "\" Zygar reported that Russian elites have even started speculating about war outcomes that would constitute a Russian victory."
        },
        {
            "id": "55",
            "sources": [],
            "text": "ISW cannot independently verify any of Zygar's reports."
        },
        {
            "id": "56",
            "sources": [],
            "text": "Zygar's statements are consistent with ISW's assessment that Russian elites came to heel behind Russian President Vladimir Putin in support of the war following intensified crackdowns against the Russian elite after Russia's full-scale invasion of Ukraine."
        },
        {
            "id": "57",
            "sources": [],
            "text": "Zygar's report that Russian elites are now assessing that Russia can prevail on the battlefield and are even discussing a Russian victory indicates that elites may also be supporting Putin's stated theory of victory, which posits that Russian forces will be able to continue gradual creeping advances indefinitely, prevent operationally significant Ukrainian counteroffensive operations, and eventually win a war of attrition."
        },
        {
            "id": "58",
            "sources": [],
            "text": ""
        },
        {
            "id": "59",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "60",
            "sources": [],
            "text": "Russian officials called for harsher punishments in Russia's criminal system, likely in response to the recent terrorist attacks in Dagestan."
        },
        {
            "id": "61",
            "sources": [],
            "text": "Russian Investigative Committee Head Alexander Bastrykin stated at the International Youth Legal Forum in St."
        },
        {
            "id": "62",
            "sources": [],
            "text": "Petersburg on June 28 that Russia should consider lifting the moratorium on the death penalty for certain, unspecified cases."
        },
        {
            "id": "63",
            "sources": [],
            "text": "Head of the Russian Constitutional Court Valery Zorkin stated on June 26 that the Constitutional Court considers the return of the death penalty to be inadmissible within the framework of the current constitution, but Bastrykin suggested on June 28 that a presidential decree may be able to lift the moratorium without changing the constitution."
        },
        {
            "id": "64",
            "sources": [],
            "text": "Bastrykin claimed that the March 2024 Crocus City Hall terrorist attack demonstrates the need for the return to the death penalty and complained that a defendant could receive the death penalty for the murder of at least two to three people during the Soviet Union, but the terrorists that conducted the Crocus City Hall attack that killed over 100 people will receive a maximum sentence of life imprisonment."
        },
        {
            "id": "65",
            "sources": [],
            "text": "Russian Justice Minister Konstantin Chuychenko stated on June 28 that the Ministry of Justice recently prepared a bill that would designate forced labor as the main punishment for more than 65 crimes."
        },
        {
            "id": "66",
            "sources": [],
            "text": "Chuychenko claimed that forced labor is a \"more humane\" form of punishment than imprisonment and reduces recidivism."
        },
        {
            "id": "67",
            "sources": [],
            "text": "Bastrykin claimed on June 27 that migrant crime is spreading in Russia and called for stricter migration policies, prompting widescale xenophobic support for Bastrykin's statements from Russia's ultranationalist milbloggers."
        },
        {
            "id": "68",
            "sources": [],
            "text": "Other Russian officials called for the return of the death penalty in the days following the March 2024 Crocus City Hall attack, and Bastrykin is likely renewing these appeals in response to the June 23 terrorist attacks in Dagestan."
        },
        {
            "id": "69",
            "sources": [],
            "text": ""
        },
        {
            "id": "70",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "71",
            "sources": [],
            "text": "Russia may be creating a shadow fleet to transport Russian liquified natural gas (LNG) and circumvent Western sanctions."
        },
        {
            "id": "72",
            "sources": [],
            "text": "Bloomberg reported on June 27 that there is evidence that Russia is creating a shadow fleet to transport Russian LNG in similar ways to how Russia created a shadow fleet to avoid the G7 price cap on Russian crude oil."
        },
        {
            "id": "73",
            "sources": [],
            "text": "Bloomberg reported that a little-known company in Dubai has acquired at least eight vessels in the past three months and that Russia has reportedly already granted four of these vessels permission to traverse Russian Arctic waters in Summer 2024."
        },
        {
            "id": "74",
            "sources": [],
            "text": "At least three of the eight vessels reportedly list their insurers as \"unknown,\" a common tactic tankers carrying Russian crude oil have used to skirt the G7 price cap."
        },
        {
            "id": "75",
            "sources": [],
            "text": "Bloomberg noted that it cannot independently connect these vessels to major Russian entities directly."
        },
        {
            "id": "76",
            "sources": [],
            "text": "The latest EU sanctions package from June 24 forbids EU entities from providing reloading services of Russian LNG in EU territory for transshipment operations to third countries."
        },
        {
            "id": "77",
            "sources": [],
            "text": ""
        },
        {
            "id": "78",
            "sources": [],
            "text": "\n"
        }
    ],
    "summary": [
        {
            "id": "1",
            "sources": [
                "8"
            ],
            "text": "Russian President Vladimir Putin has dispatched nuclear-capable short- and intermediate-range missiles in response to the US withdrawal from the Intermediate-Range Nuclear Forces (INF) treaty."
        },
        {
            "id": "2",
            "sources": [
                "8",
                "9",
                "10",
                "11",
                "12"
            ],
            "text": "Putin has used the US bilateral military exercises with the Philippines and Denmark as justification, as these exercises involve launchers capable of missile deployments."
        },
        {
            "id": "3",
            "sources": [
                "27",
                "28",
                "29",
                "30"
            ],
            "text": "Ukrainian forces have reportedly struck an oil depot and a military unit in Russia, causing significant damage."
        },
        {
            "id": "4",
            "sources": [
                "48",
                "49"
            ],
            "text": "Russian elites who were initially opposed to the war have started rallying behind Putin, citing steady battlefield gains."
        },
        {
            "id": "5",
            "sources": [
                "71",
                "72",
                "73",
                "74"
            ],
            "text": "Russia is reportedly creating a 'shadow fleet' in an attempt to avoid Western sanctions through the transport of Russian liquefied natural gas."
        }
    ]
}