{
    "conversationId": "f32b239d-42fe-4f7c-a1c6-fc827f535eb4",
    "source": [
        {
            "id": "1",
            "sources": [],
            "text": "Russian Offensive Campaign Assessment, July 8, 2024."
        },
        {
            "id": "2",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "3",
            "sources": [],
            "text": "Nicole Wolkov, Grace Mappes, Christina Harward, Karolina Hird, and Frederick W."
        },
        {
            "id": "4",
            "sources": [],
            "text": "Kagan."
        },
        {
            "id": "5",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "6",
            "sources": [],
            "text": "July 8, 2024, 6pm ET."
        },
        {
            "id": "7",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "8",
            "sources": [],
            "text": "A Russian Kh-101 cruise missile hit the Okhmatdyt Children's Hospital in central Kyiv during a wider series of missile strikes targeting critical Ukrainian infrastructure throughout the day on July 8."
        },
        {
            "id": "9",
            "sources": [],
            "text": "Ukrainian Air Force Commander Lieutenant General Mykola Oleshchuk stated that Russian forces conducted two rounds of combined missile strikes on July 8—first launching four Kh-101 cruise missiles from Saratov Oblast and two Iskander-M ballistic missiles from occupied Crimea and Kursk Oblast overnight on July 7 to 8, and then launching a second wave of missiles, including one Kh-47 Kinzhal aeroballistic missile, four Iskander-M ballistic missiles, one 3M22 Zircon cruise missile, 13 Kh-101 cruise missiles, 14 Kalibr cruise missiles, two Kh-22 cruise missiles, and three Kh-59/69 guided air missiles around 1000 local time on July 8."
        },
        {
            "id": "10",
            "sources": [],
            "text": "Ukrainian air defense shot down two Kh-101s in the first wave, and one Kh-47, three Iskanders, 11 Kh-101s, 12 Kalibrs, and three Kh-59/69s during the second wave."
        },
        {
            "id": "11",
            "sources": [],
            "text": "Ukrainian President Volodymyr Zelensky stated that Russian forces targeted residential and other civilian infrastructure in Kyiv, Dnipro, Kryvyi Rih, Slovyansk, and Kramatorsk cities."
        },
        {
            "id": "12",
            "sources": [],
            "text": ""
        },
        {
            "id": "13",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "14",
            "sources": [],
            "text": "Footage taken by a bystander in Kyiv City shows the second before a Russian missile struck the Okhmatdyt Children's Hospital—Ukraine's largest pediatric hospital that treats thousands of patients, including cancer cases, daily."
        },
        {
            "id": "15",
            "sources": [],
            "text": "The footage clearly shows a single missile flying at a sharp downward trajectory before making contact with the hospital building."
        },
        {
            "id": "16",
            "sources": [],
            "text": "Ukraine's Security Service (SBU) conducted a preliminary investigation of the blast site at Okhmatdyt and concluded that Russian forces used a Kh-101 missile to strike the hospital."
        },
        {
            "id": "17",
            "sources": [],
            "text": "The Okhmatdyt Children's Hospital published footage showing extensive damage to medical facilities on the premises."
        },
        {
            "id": "18",
            "sources": [],
            "text": "Falling debris from Russian missiles also struck the Isida Maternity Hospital in western Kyiv City after the initial strike on the Okhmatdyt hospital, and Russian missile strikes also damaged residential infrastructure elsewhere both in Kyiv and Dnipro cities."
        },
        {
            "id": "19",
            "sources": [],
            "text": "The Ukrainian Ministry of Internal Affairs has confirmed 22 deaths and 74 injured in Kyiv City and 11 deaths and 64 injured within Dnipropetrovsk Oblast as of the time of this publication."
        },
        {
            "id": "20",
            "sources": [],
            "text": "Zelensky announced that Ukraine is convening an emergency session of the United Nations Security Council (UNSC) in response to these Russian strikes."
        },
        {
            "id": "21",
            "sources": [],
            "text": "Russia is currently the president of the UNSC."
        },
        {
            "id": "22",
            "sources": [],
            "text": ""
        },
        {
            "id": "23",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "24",
            "sources": [],
            "text": "Russian officials and information space actors are attempting to deflect responsibility for the Okhmatdyt Children's Hospital strike by making false claims about the missiles involved and the state of the hospital — all contrary to available evidence."
        },
        {
            "id": "25",
            "sources": [],
            "text": "The Ukrainian Center for Countering Disinformation warned on July 9 that various Russian propaganda sources are amplifying a wide variety of information operations deflecting blame for the strike away from Russia, including false claims that Ukraine was using part or all of the hospital to treat wounded Ukrainian soldiers, that Ukraine was storing missiles at the hospital, and that Ukrainian air defense missiles and not a Russian missile hit the hospital."
        },
        {
            "id": "26",
            "sources": [],
            "text": "The Russian Ministry of Defense (MoD) claimed that available footage \"clearly confirms\" that falling Ukrainian air defense missiles damaged civilian objects within Kyiv City, likely referring to the Okhmatdyt Children's Hospital and not to another medical facility within the city that Ukrainian officials acknowledged was damaged by falling missile debris."
        },
        {
            "id": "27",
            "sources": [],
            "text": "Russian sources widely circulated the footage and image of the missile in the second before it hit the Okhmatdyt Children's Hospital, and some milbloggers even published misleading posts falsely claiming that it was a Ukrainian air defense missile and not an attacking Russian Kh-101 missile."
        },
        {
            "id": "28",
            "sources": [],
            "text": "The trajectory of the missile in the video and the visible turbojet engine under its hull match the frame of a Russian Kh-101 and do not support claims that it was an air defense interceptor, nor does the missile appear damaged by air defense interceptors."
        },
        {
            "id": "29",
            "sources": [],
            "text": "The Ukrainian SBU also reported that the serial numbers of the missile components match those of other Russian Kh-101s launched at Ukraine."
        },
        {
            "id": "30",
            "sources": [],
            "text": "Some Russian milbloggers claimed that Russian forces were attempting to strike the Artem machine building plant roughly 1."
        },
        {
            "id": "31",
            "sources": [],
            "text": "6 kilometers north of the Okhmatdyt Children's Hospital, but other Russian missiles actually hit the Artem Plant during the strike."
        },
        {
            "id": "32",
            "sources": [],
            "text": ""
        },
        {
            "id": "33",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "34",
            "sources": [],
            "text": "Many of these false Russian information operations would not absolve Russian forces of legal or moral responsibility for the impacts of their strikes against Ukraine even if true."
        },
        {
            "id": "35",
            "sources": [],
            "text": "Russian information operations falsely portraying the Okhmatdyt Children's Hospital as partially or completely a military hospital falsely suggest that such a hospital is inherently a legitimate military target."
        },
        {
            "id": "36",
            "sources": [],
            "text": "The Okhmatdyt Children's Hospital is notably not a military hospital—it is the largest multidisciplinary children's hospital in Ukraine and treats up to 18,000 children per year."
        },
        {
            "id": "37",
            "sources": [],
            "text": "Article 19 of the Geneva Convention, to which Russia is a signatory, relative to the Protection of Civilian Persons in Time of War states that the international legal protection to civilian hospitals does not end unless the hospital undertakes \"acts harmful to the enemy,\" and Article 19 explicitly excludes the presence of sick or wounded military personnel as an act \"harmful to the enemy."
        },
        {
            "id": "38",
            "sources": [],
            "text": "\" Article 19 also states that the \"enemy\" must give a warning prior to attacking a hospital allegedly containing a \"harmful\" military target, and no Russian sources are claiming that Russian authorities issued such a warning, nor have any offered proof that a hospital full of sick children was posing an imminent threat to Russian forces."
        },
        {
            "id": "39",
            "sources": [],
            "text": "The Russian MoD's claim that a Ukrainian air defense interceptor hit civilian objects and Russian milblogger claims that a Russian missile accidentally hit the hospital also do not absolve Russian forces of responsibility for these consequences, as Russia is the aggressor state in this war and Ukraine would not have to defend against Russian strikes if Russia had not launched its full-scale invasion of and routine missile strike series against Ukraine."
        },
        {
            "id": "40",
            "sources": [],
            "text": ""
        },
        {
            "id": "41",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "42",
            "sources": [],
            "text": "The July 8 Russian missile strikes likely employed a new and noteworthy tactic to maximize the damage from such strike series."
        },
        {
            "id": "43",
            "sources": [],
            "text": "Former Ukrainian Air Forces Spokesperson Colonel Yuriy Ihnat stated following the strikes on July 8 that Russian forces are constantly improving their reconnaissance and strike drone capabilities and the efficacy of both cruise and ballistic missiles, noting that during the July 8 strike Russian cruise missiles flew at \"extremely low\" altitudes."
        },
        {
            "id": "44",
            "sources": [],
            "text": "Ihnat noted that in some cases, Ukrainian air defense forces had to attempt to intercept cruise missiles flying as low as 50 meters above the ground."
        },
        {
            "id": "45",
            "sources": [],
            "text": "Ukrainian air defenses have historically had high shoot-down rates for certain types of cruise missiles, particularly the older Kh-101 variety, but Ihnat's suggestion of Russian forces launching cruise missile strikes at such low altitudes indicates that Russian forces may have innovated their tactics and/or technology somewhat to inflict maximum damage on Ukrainian infrastructure by giving Ukrainian air defense practically no time to respond until the missile is already within close range of the ground."
        },
        {
            "id": "46",
            "sources": [],
            "text": "Ihnat noted that Russian forces are reducing the electromagnetic signatures of the drones until the last possible moment to prevent their detection by Ukrainian forces, which Ihnat noted means that by the time Ukrainian forces detect the drone, the missile the drone was guiding could already be close to the target point."
        },
        {
            "id": "47",
            "sources": [],
            "text": "Russia has consistently adapted the strike packages it uses against Ukraine to take advantage of Ukraine's air defense shortages, and the July 8 strikes represent a new and adapted strike package that Ukraine will need to learn to respond to with requisite levels of Western-provided air defense systems."
        },
        {
            "id": "48",
            "sources": [],
            "text": ""
        },
        {
            "id": "49",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "50",
            "sources": [],
            "text": "Hungarian Prime Minister Viktor Orban and People's Republic of China (PRC) President Xi Jinping continued to posture themselves as potential mediators to an end to the war in Ukraine during a July 8 meeting in Beijing, despite Russian President Vladimir Putin's rejection of serious negotiations or any third-party mediation."
        },
        {
            "id": "51",
            "sources": [],
            "text": "Orban called the PRC a \"key power\" in creating conditions for peace and stated that Hungary highly appreciates the PRC's peace initiative."
        },
        {
            "id": "52",
            "sources": [],
            "text": "Xi stated that the international community should support direct negotiations between Russia and Ukraine and that other unspecified major world powers should employ \"positive energy rather than negative energy\" to support a ceasefire as soon as possible."
        },
        {
            "id": "53",
            "sources": [],
            "text": "Xi also claimed that the PRC and Hungary share the same basic proposals to end the war."
        },
        {
            "id": "54",
            "sources": [],
            "text": "Orban and Xi are likely trying to mutually reinforce each other's efforts to portray Hungary and the PRC as neutral mediators despite Orban's consistent efforts to oppose and undermine the European Union's (EU) support for Ukraine and increasing evidence that the PRC is supporting Russia's war effort by providing Russia with dual-use goods and unconfirmed reports of joint PRC–Russian production of loitering munitions."
        },
        {
            "id": "55",
            "sources": [],
            "text": "Ukrainian President Volodymyr Zelensky responded to a question at a July 8 press conference about whether Hungary could serve as a mediator to an end to the war and stated that only serious and strong alliances could stop the war and that a foreign country's representative holding bilateral discussions with Putin does not indicate Putin's interest in ending the war."
        },
        {
            "id": "56",
            "sources": [],
            "text": "Zelensky also noted that countries with strong economies that influence Russia's economy and countries with militaries that threaten Russia's military - such as the US, the PRC, and the entire EU — could lead international mediation efforts and pressure Russia."
        },
        {
            "id": "57",
            "sources": [],
            "text": "Putin rejected Russian participation in possible ceasefire negotiations processes, denied interest in a ceasefire altogether, and demanded Ukrainian capitulation through \"demilitarization\" and the surrender of significant territory that Russia does not currently occupy on July 4 and 5."
        },
        {
            "id": "58",
            "sources": [],
            "text": ""
        },
        {
            "id": "59",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "60",
            "sources": [],
            "text": "Russian Vice Admiral Sergei Lipilin replaced Vice Admiral Vladimir Vorobyov as Russian Baltic Fleet Commander."
        },
        {
            "id": "61",
            "sources": [],
            "text": "The Russian military officially introduced Lipilin as Baltic Fleet Commander at a Russian Navy ceremony in Kronstadt in St."
        },
        {
            "id": "62",
            "sources": [],
            "text": "Petersburg on July 8."
        },
        {
            "id": "63",
            "sources": [],
            "text": "Lipilin previously served as the Baltic Fleet's Chief of Staff and First Deputy Commander since 2021, and Vorobyov is now Deputy Commander-in-Chief of the Russian Navy."
        },
        {
            "id": "64",
            "sources": [],
            "text": ""
        },
        {
            "id": "65",
            "sources": [],
            "text": "\n"
        },
        {
            "id": "66",
            "sources": [],
            "text": "The Russian Ministry of Foreign Affairs (MFA) claimed on July 8 that a May 2024 op-ed by an ISW Russia analyst published in the Telegraph was unsubstantiated."
        },
        {
            "id": "67",
            "sources": [],
            "text": "The op-ed was a brief presentation of in-depth and well-documented research that ISW has published regarding Russia's occupation of Ukraine and project to destroy Ukrainian statehood via genocidal means."
        },
        {
            "id": "68",
            "sources": [],
            "text": "ISW stands by its assessments, including those presented in the Telegraph op-ed."
        },
        {
            "id": "69",
            "sources": [],
            "text": ""
        },
        {
            "id": "70",
            "sources": [],
            "text": "\n"
        }
    ],
    "summary": [
        {
            "id": "1",
            "sources": [
                "8",
                "9"
            ],
            "text": "Russian forces have hit key Ukrainian infrastructure with a series of missile strikes, including the Okhmatdyt Children's Hospital in central Kyiv."
        },
        {
            "id": "2",
            "sources": [
                "24",
                "25"
            ],
            "text": "Russian forces maintain an information operation, pushing false narratives targeting evidence of the missile strike, including claims that Ukraine was using the hospital for military purposes."
        },
        {
            "id": "3",
            "sources": [
                "20"
            ],
            "text": "Ukrainian President Volodymyr Zelensky calls for an emergency United Nations Security Council (UNSC) meeting in response to these attacks."
        },
        {
            "id": "4",
            "sources": [
                "50",
                "51"
            ],
            "text": "Despite Russian President Vladimir Putin's refusal to participate in negotiations or allow third-party mediation, Hungarian Prime Minister Viktor Orban and People's Republic of China (PRC) President Xi Jinping posture themselves as potential mediators."
        },
        {
            "id": "5",
            "sources": [
                "60",
                "62"
            ],
            "text": "Russian Vice Admiral Sergei Lipilin has replaced Vice Admiral Vladimir Vorobyov as the Commander of the Russian Baltic Fleet."
        }
    ]
}